---
kind: method
id: M:Autodesk.Revit.DB.DWGExportOptions.#ctor(Autodesk.Revit.DB.DWGExportOptions)
source: html/73eb12c2-04a6-a91d-20f0-a1586f56782a.htm
---
# Autodesk.Revit.DB.DWGExportOptions.#ctor Method

Constructs a new instance of DWGExportOptions as a copy of the export options.

## Syntax (C#)
```csharp
public DWGExportOptions(
	DWGExportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.DWGExportOptions`) - The options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null